tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'oven-sh/bun'
tap 'supabase/tap'
tap 'thegnarco/gnar'
tap 'wix/brew'

brew 'asdf'
brew 'bundletool'
brew 'cmake'
brew 'deno'
brew 'docker', link: false
brew 'libsodium'
brew 'fastlane'
brew 'flyctl'
brew 'fzf'
brew 'gh'
brew 'unbound'
brew 'gnutls'
brew 'gnupg'
brew 'guile'
brew 'krb5'
brew 'tmux'
brew 'overmind'
brew 'postgresql@14', restart_service: true
brew 'python@3.11'
brew 'redis', restart_service: true
brew 'watchman'
brew 'heroku/brew/heroku'
brew 'oven-sh/bun/bun'
brew 'supabase/tap/supabase'
brew 'thegnarco/gnar/gnar'
brew 'wix/brew/applesimutils'
cask '1password'
cask 'chromedriver'
cask 'devutils'
cask 'discord'
cask 'docker'
cask 'font-fira-code'
cask 'google-chrome'
cask 'ngrok'
cask 'rectangle'
cask 'rowanj-gitx'
cask 'slack'
cask 'tuple'
cask 'visual-studio-code'
cask 'zulu17'
vscode 'aki77.rails-view-component'
vscode 'alefragnani.bookmarks'
vscode 'aliariff.vscode-erb-beautify'
vscode 'bierner.markdown-emoji'
vscode 'buenon.scratchpads'
vscode 'castwide.solargraph'
vscode 'christian-kohler.npm-intellisense'
vscode 'cschlosser.doxdocgen'
vscode 'davidanson.vscode-markdownlint'
vscode 'dbaeumer.vscode-eslint'
vscode 'denoland.vscode-deno'
vscode 'dotjoshjohnson.xml'
vscode 'eamodio.gitlens'
vscode 'editorconfig.editorconfig'
vscode 'esbenp.prettier-vscode'
vscode 'expo.vscode-expo-tools'
vscode 'felicio.vscode-fold'
vscode 'gamunu.vscode-yarn'
vscode 'ginfuru.ginfuru-better-solarized-dark-theme'
vscode 'github.copilot'
vscode 'github.copilot-chat'
vscode 'github.github-vscode-theme'
vscode 'github.heygithub'
vscode 'github.remotehub'
vscode 'github.vscode-codeql'
vscode 'github.vscode-github-actions'
vscode 'github.vscode-pull-request-github'
vscode 'grapecity.gc-excelviewer'
vscode 'groksrc.ruby'
vscode 'hbenl.vscode-test-explorer'
vscode 'hoovercj.ruby-linter'
vscode 'jinhyuk.replace-curly-quotes'
vscode 'jnbt.vscode-rufo'
vscode 'kamikillerto.vscode-colorize'
vscode 'miguel-savignano.ruby-symbols'
vscode 'misogi.ruby-rubocop'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode-remote.remote-wsl'
vscode 'ms-vscode.azure-repos'
vscode 'ms-vscode.cmake-tools'
vscode 'ms-vscode.cpptools'
vscode 'ms-vscode.cpptools-extension-pack'
vscode 'ms-vscode.makefile-tools'
vscode 'ms-vscode.remote-explorer'
vscode 'ms-vscode.remote-repositories'
vscode 'ms-vscode.test-adapter-converter'
vscode 'ms-vscode.vscode-js-profile-flame'
vscode 'ms-vscode.vscode-typescript-next'
vscode 'ms-vsliveshare.vsliveshare'
vscode 'ms-vsliveshare.vsliveshare-pack'
vscode 'nicollasr.vscode-streamdeck'
vscode 'platformio.platformio-ide'
vscode 'redhat.vscode-xml'
vscode 'rvest.vs-code-prettier-eslint'
vscode 'shopify.ruby-lsp'
vscode 'svelte.svelte-vscode'
vscode 'tombonnike.vscode-status-bar-format-toggle'
vscode 'twxs.cmake'
vscode 'vayan.haml'
vscode 'vortizhe.simple-ruby-erb'
vscode 'vscodevim.vim'
vscode 'waderyan.gitblame'
vscode 'walkme.ruby-extension-pack'
vscode 'zainchen.json'
