tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "oven-sh/bun"
tap "supabase/tap"
tap "thegnarco/gnar"
tap "wix/brew"
brew "asdf"
brew "icu4c@76"
brew "bundletool"
brew "cmake"
brew "deno"
brew "docker", link: false
brew "libsodium"
brew "fastlane"
brew "flyctl"
brew "fzf"
brew "gh"
brew "unbound", restart_service: true
brew "gnutls"
brew "gnupg"
brew "guile"
brew "krb5"
brew "tmux"
brew "overmind"
brew "postgresql@14", restart_service: true
brew "python@3.11"
brew "redis", restart_service: true
brew "ripgrep"
brew "watchman"
brew "heroku/brew/heroku"
brew "oven-sh/bun/bun"
brew "supabase/tap/supabase"
brew "thegnarco/gnar/gnar"
brew "wix/brew/applesimutils"
cask "1password"
cask "chromedriver"
cask "devutils"
cask "discord"
cask "docker"
cask "font-fira-code"
cask "google-chrome"
cask "ngrok"
cask "notunes"
cask "rectangle"
cask "rowanj-gitx"
cask "slack"
cask "tuple"
cask "visual-studio-code"
cask "zulu@17"
vscode "alefragnani.bookmarks"
vscode "bierner.markdown-emoji"
vscode "buenon.scratchpads"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "felicio.vscode-fold"
vscode "folke.vscode-monorepo-workspace"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-codeql"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "hbenl.vscode-test-explorer"
vscode "kamikillerto.vscode-colorize"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "nicollasr.vscode-streamdeck"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-xml"
vscode "rvest.vs-code-prettier-eslint"
vscode "svelte.svelte-vscode"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "vunguyentuan.vscode-css-variables"
vscode "waderyan.gitblame"
vscode "yoavbls.pretty-ts-errors"
vscode "zainchen.json"
